podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK22F51212.h
/**
 * @file      PinMapping.h
 * @version   1.0.0
 * @brief     Pin declarations for MK22F51212
 */

#ifndef PINMAPPING_H_
#define PINMAPPING_H_

#include "derivative.h"

//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------  

// <h> FTM Clock settings

// FTM_SC.CLKS ================================
//
//   <o> FTM_SC.CLKS Clock source 
//   <i> Selects the clock source for the FTM module. [FTM_SC.CLKS]
//     <0=> Disabled
//     <1=> System clock
//     <2=> Fixed frequency clock
//     <3=> External clock
//     <1=> Default
// FTM_SC.PS ================================
//
//   <o1> FTM_SC.PS Clock prescaler 
//   <i> Selects the prescaler for the FTM module. [FTM_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
#define FTM_SC               (FTM_SC_CLKS(0x1)|FTM_SC_PS(0x0))

// </h>

#define ADC0_CLOCK_REG       SIM->SCGC6          
#define ADC0_CLOCK_MASK      SIM_SCGC6_ADC0_MASK 
#define ADC1_CLOCK_REG       SIM->SCGC6          
#define ADC1_CLOCK_MASK      SIM_SCGC6_ADC1_MASK 
#define I2C0_CLOCK_REG       SIM->SCGC4          
#define I2C0_CLOCK_MASK      SIM_SCGC4_I2C0_MASK 
#define I2C1_CLOCK_REG       SIM->SCGC4          
#define I2C1_CLOCK_MASK      SIM_SCGC4_I2C1_MASK 
#define SPI0_CLOCK_REG       SIM->SCGC6          
#define SPI0_CLOCK_MASK      SIM_SCGC6_SPI0_MASK 
#define SPI1_CLOCK_REG       SIM->SCGC6          
#define SPI1_CLOCK_MASK      SIM_SCGC6_SPI1_MASK 
#define FTM0_CLOCK_REG       SIM->SCGC6          
#define FTM0_CLOCK_MASK      SIM_SCGC6_FTM0_MASK 
#define FTM1_CLOCK_REG       SIM->SCGC6          
#define FTM1_CLOCK_MASK      SIM_SCGC6_FTM1_MASK 
#define FTM2_CLOCK_REG       SIM->SCGC6          
#define FTM2_CLOCK_MASK      SIM_SCGC6_FTM2_MASK 

// <h> Pin Peripheral mapping

// ADC0_12 maps to [Disabled, PTB2]
//   <o> ADC0_12 Pin Selection [PTB2(A5)] <constant>
//   <i> Selects which pin is used for ADC0_12
//     <0=> Disabled
//     <1=> PTB2 (Alias: A5)
//     <1=> Default
#define ADC0_12_SEL          1                   

// ADC0_13 maps to [Disabled, PTB3]
//   <o> ADC0_13 Pin Selection [PTB3(A4)] <constant>
//   <i> Selects which pin is used for ADC0_13
//     <0=> Disabled
//     <1=> PTB3 (Alias: A4)
//     <1=> Default
#define ADC0_13_SEL          1                   

// ADC0_14 maps to [Disabled, PTC0]
//   <o> ADC0_14 Pin Selection [PTC0] <constant>
//   <i> Selects which pin is used for ADC0_14
//     <0=> Disabled
//     <1=> PTC0
//     <1=> Default
#define ADC0_14_SEL          1                   

// ADC0_15 maps to [Disabled, PTC1]
//   <o> ADC0_15 Pin Selection [PTC1(A2)] <constant>
//   <i> Selects which pin is used for ADC0_15
//     <0=> Disabled
//     <1=> PTC1 (Alias: A2)
//     <1=> Default
#define ADC0_15_SEL          1                   

// ADC0_17 maps to [Disabled, PTE24]
//   <o> ADC0_17 Pin Selection [PTE24] <constant>
//   <i> Selects which pin is used for ADC0_17
//     <0=> Disabled
//     <1=> PTE24
//     <1=> Default
#define ADC0_17_SEL          1                   

// ADC0_18 maps to [Disabled, PTE25]
//   <o> ADC0_18 Pin Selection [PTE25] <constant>
//   <i> Selects which pin is used for ADC0_18
//     <0=> Disabled
//     <1=> PTE25
//     <1=> Default
#define ADC0_18_SEL          1                   

// ADC0_23 maps to [Disabled, ADC0_SE23]
//   <o> ADC0_23 Pin Selection [ADC0_SE23] <constant>
//   <i> Selects which pin is used for ADC0_23
//     <0=> Disabled
//     <1=> ADC0_SE23
//     <1=> Default
#define ADC0_23_SEL          1                   

// ADC0_4 maps to [Disabled, PTC2]
//   <o> ADC0_4 Pin Selection [PTC2(A3)] <constant>
//   <i> Selects which pin is used for ADC0_4
//     <0=> Disabled
//     <1=> PTC2 (Alias: A3)
//     <1=> Default
#define ADC0_4_SEL           1                   

// ADC0_5 maps to [Disabled, PTD1]
//   <o> ADC0_5 Pin Selection [PTD1] <constant>
//   <i> Selects which pin is used for ADC0_5
//     <0=> Disabled
//     <1=> PTD1
//     <1=> Default
#define ADC0_5_SEL           1                   

// ADC0_6 maps to [Disabled, PTD5]
//   <o> ADC0_6 Pin Selection [PTD5(D13)] <constant>
//   <i> Selects which pin is used for ADC0_6
//     <0=> Disabled
//     <1=> PTD5 (Alias: D13)
//     <1=> Default
#define ADC0_6_SEL           1                   

// ADC0_7 maps to [Disabled, PTD6]
//   <o> ADC0_7 Pin Selection [PTD6(D11)] <constant>
//   <i> Selects which pin is used for ADC0_7
//     <0=> Disabled
//     <1=> PTD6 (Alias: D11)
//     <1=> Default
#define ADC0_7_SEL           1                   

// ADC1_12 maps to [Disabled, PTB6]
//   <o> ADC1_12 Pin Selection [PTB6] <constant>
//   <i> Selects which pin is used for ADC1_12
//     <0=> Disabled
//     <1=> PTB6
//     <1=> Default
#define ADC1_12_SEL          1                   

// ADC1_13 maps to [Disabled, PTB7]
//   <o> ADC1_13 Pin Selection [PTB7] <constant>
//   <i> Selects which pin is used for ADC1_13
//     <0=> Disabled
//     <1=> PTB7
//     <1=> Default
#define ADC1_13_SEL          1                   

// ADC1_14 maps to [Disabled, PTB10]
//   <o> ADC1_14 Pin Selection [PTB10] <constant>
//   <i> Selects which pin is used for ADC1_14
//     <0=> Disabled
//     <1=> PTB10
//     <1=> Default
#define ADC1_14_SEL          1                   

// ADC1_15 maps to [Disabled, PTB11]
//   <o> ADC1_15 Pin Selection [PTB11] <constant>
//   <i> Selects which pin is used for ADC1_15
//     <0=> Disabled
//     <1=> PTB11
//     <1=> Default
#define ADC1_15_SEL          1                   

// ADC1_17 maps to [Disabled, PTA17]
//   <o> ADC1_17 Pin Selection [PTA17] <constant>
//   <i> Selects which pin is used for ADC1_17
//     <0=> Disabled
//     <1=> PTA17
//     <1=> Default
#define ADC1_17_SEL          1                   

// ADC1_18 maps to [Disabled, ADC1_SE18]
//   <o> ADC1_18 Pin Selection [ADC1_SE18] <constant>
//   <i> Selects which pin is used for ADC1_18
//     <0=> Disabled
//     <1=> ADC1_SE18
//     <1=> Default
#define ADC1_18_SEL          1                   

// ADC1_23 maps to [Disabled, ADC1_SE23]
//   <o> ADC1_23 Pin Selection [ADC1_SE23] <constant>
//   <i> Selects which pin is used for ADC1_23
//     <0=> Disabled
//     <1=> ADC1_SE23
//     <1=> Default
#define ADC1_23_SEL          1                   

// ADC1_4 maps to [Disabled, PTC8]
//   <o> ADC1_4 Pin Selection [PTC8] <constant>
//   <i> Selects which pin is used for ADC1_4
//     <0=> Disabled
//     <1=> PTC8
//     <1=> Default
#define ADC1_4_SEL           1                   

// ADC1_5 maps to [Disabled, PTC9]
//   <o> ADC1_5 Pin Selection [PTC9] <constant>
//   <i> Selects which pin is used for ADC1_5
//     <0=> Disabled
//     <1=> PTC9
//     <1=> Default
#define ADC1_5_SEL           1                   

// ADC1_6 maps to [Disabled, PTC10]
//   <o> ADC1_6 Pin Selection [PTC10] <constant>
//   <i> Selects which pin is used for ADC1_6
//     <0=> Disabled
//     <1=> PTC10
//     <1=> Default
#define ADC1_6_SEL           1                   

// ADC1_7 maps to [Disabled, PTC11]
//   <o> ADC1_7 Pin Selection [PTC11] <constant>
//   <i> Selects which pin is used for ADC1_7
//     <0=> Disabled
//     <1=> PTC11
//     <1=> Default
#define ADC1_7_SEL           1                   

