podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK22F51212.h
// ADC1_8 maps to [Disabled, PTB0]
//   <o> ADC1_8 Pin Selection [PTB0(A0)] <constant>
//   <i> Selects which pin is used for ADC1_8
//     <0=> Disabled
//     <1=> PTB0 (Alias: A0)
//     <1=> Default
#define ADC1_8_SEL           1                   

// ADC1_9 maps to [Disabled, PTB1]
//   <o> ADC1_9 Pin Selection [PTB1(A1)] <constant>
//   <i> Selects which pin is used for ADC1_9
//     <0=> Disabled
//     <1=> PTB1 (Alias: A1)
//     <1=> Default
#define ADC1_9_SEL           1                   

// FTM0_0 maps to [Disabled, PTA3, PTC1]
//   <o> FTM0_0 Pin Selection [PTA3, PTC1(A2)] 
//   <i> Selects which pin is used for FTM0_0
//     <0=> Disabled
//     <1=> PTA3
//     <2=> PTC1 (Alias: A2)
//     <2=> Default
#define FTM0_0_SEL           2                   

// FTM0_1 maps to [Disabled, PTA4, PTC2]
//   <o> FTM0_1 Pin Selection [PTA4(D4), PTC2(A3)] 
//   <i> Selects which pin is used for FTM0_1
//     <0=> Disabled
//     <1=> PTA4 (Alias: D4)
//     <2=> PTC2 (Alias: A3)
//     <1=> Default
#define FTM0_1_SEL           1                   

// FTM0_2 maps to [Disabled, PTA5, PTC3, PTC5]
//   <o> FTM0_2 Pin Selection [PTA5, PTC3(D6), PTC5] 
//   <i> Selects which pin is used for FTM0_2
//     <0=> Disabled
//     <1=> PTA5
//     <2=> PTC3 (Alias: D6)
//     <3=> PTC5
//     <2=> Default
#define FTM0_2_SEL           2                   

// FTM0_3 maps to [Disabled, PTC4]
//   <o> FTM0_3 Pin Selection [PTC4] <constant>
//   <i> Selects which pin is used for FTM0_3
//     <0=> Disabled
//     <1=> PTC4
//     <1=> Default
#define FTM0_3_SEL           1                   

// FTM0_4 maps to [Disabled, PTD4]
//   <o> FTM0_4 Pin Selection [PTD4(D10)] <constant>
//   <i> Selects which pin is used for FTM0_4
//     <0=> Disabled
//     <1=> PTD4 (Alias: D10)
//     <1=> Default
#define FTM0_4_SEL           1                   

// FTM0_5 maps to [Disabled, PTA0, PTD5]
//   <o> FTM0_5 Pin Selection [PTA0, PTD5(D13)] 
//   <i> Selects which pin is used for FTM0_5
//     <0=> Disabled
//     <1=> PTA0
//     <2=> PTD5 (Alias: D13)
//     <2=> Default
#define FTM0_5_SEL           2                   

// FTM0_6 maps to [Disabled, PTA1, PTD6]
//   <o> FTM0_6 Pin Selection [PTA1(D9), PTD6(D11)] 
//   <i> Selects which pin is used for FTM0_6
//     <0=> Disabled
//     <1=> PTA1 (Alias: D9)
//     <2=> PTD6 (Alias: D11)
//     <1=> Default
#define FTM0_6_SEL           1                   

// FTM0_7 maps to [Disabled, PTA2, PTD7]
//   <o> FTM0_7 Pin Selection [PTA2(D3), PTD7(D12)] 
//   <i> Selects which pin is used for FTM0_7
//     <0=> Disabled
//     <1=> PTA2 (Alias: D3)
//     <2=> PTD7 (Alias: D12)
//     <1=> Default
#define FTM0_7_SEL           1                   

// FTM1_0 maps to [Disabled, PTA12, PTB0]
//   <o> FTM1_0 Pin Selection [PTA12, PTB0(A0)] 
//   <i> Selects which pin is used for FTM1_0
//     <0=> Disabled
//     <1=> PTA12
//     <2=> PTB0 (Alias: A0)
//     <2=> Default
#define FTM1_0_SEL           2                   

// FTM1_1 maps to [Disabled, PTA13, PTB1]
//   <o> FTM1_1 Pin Selection [PTA13, PTB1(A1)] 
//   <i> Selects which pin is used for FTM1_1
//     <0=> Disabled
//     <1=> PTA13
//     <2=> PTB1 (Alias: A1)
//     <2=> Default
#define FTM1_1_SEL           2                   

// FTM2_0 maps to [Disabled, PTB18]
//   <o> FTM2_0 Pin Selection [PTB18(D5)] <constant>
//   <i> Selects which pin is used for FTM2_0
//     <0=> Disabled
//     <1=> PTB18 (Alias: D5)
//     <1=> Default
#define FTM2_0_SEL           1                   

// FTM2_1 maps to [Disabled, PTB19]
//   <o> FTM2_1 Pin Selection [PTB19(D8)] <constant>
//   <i> Selects which pin is used for FTM2_1
//     <0=> Disabled
//     <1=> PTB19 (Alias: D8)
//     <1=> Default
#define FTM2_1_SEL           1                   

// I2C0_SCL maps to [Disabled, PTB0, PTB2, PTD2, PTE24]
//   <o> I2C0_SCL Pin Selection [PTB0(A0), PTB2(A5), PTD2(D0), PTE24] 
//   <i> Selects which pin is used for I2C0_SCL
//     <0=> Disabled
//     <1=> PTB0 (Alias: A0)
//     <2=> PTB2 (Alias: A5)
//     <3=> PTD2 (Alias: D0)
//     <4=> PTE24
//     <2=> Default
#define I2C0_SCL_SEL         2                   

// I2C0_SDA maps to [Disabled, PTB1, PTB3, PTD3, PTE25]
//   <o> I2C0_SDA Pin Selection [PTB1(A1), PTB3(A4), PTD3(D1), PTE25] 
//   <i> Selects which pin is used for I2C0_SDA
//     <0=> Disabled
//     <1=> PTB1 (Alias: A1)
//     <2=> PTB3 (Alias: A4)
//     <3=> PTD3 (Alias: D1)
//     <4=> PTE25
//     <2=> Default
#define I2C0_SDA_SEL         2                   

// I2C1_SCL maps to [Disabled, PTC10, PTE1]
//   <o> I2C1_SCL Pin Selection [PTC10, PTE1(D15)] 
//   <i> Selects which pin is used for I2C1_SCL
//     <0=> Disabled
//     <1=> PTC10
//     <2=> PTE1 (Alias: D15)
//     <2=> Default
#define I2C1_SCL_SEL         2                   

// I2C1_SDA maps to [Disabled, PTC11, PTE0]
//   <o> I2C1_SDA Pin Selection [PTC11, PTE0(D14)] 
//   <i> Selects which pin is used for I2C1_SDA
//     <0=> Disabled
//     <1=> PTC11
//     <2=> PTE0 (Alias: D14)
//     <2=> Default
#define I2C1_SDA_SEL         2                   

// SPI0_PCS0 maps to [Disabled, PTA14, PTC4, PTD0]
//   <o> SPI0_PCS0 Pin Selection [PTA14, PTC4, PTD0] 
//   <i> Selects which pin is used for SPI0_PCS0
//     <0=> Disabled
//     <1=> PTA14
//     <2=> PTC4
//     <3=> PTD0
//     <0=> Default
#define SPI0_PCS0_SEL        0                   

// SPI0_PCS1 maps to [Disabled, PTC3, PTD4]
//   <o> SPI0_PCS1 Pin Selection [PTC3(D6), PTD4(D10)] 
//   <i> Selects which pin is used for SPI0_PCS1
//     <0=> Disabled
//     <1=> PTC3 (Alias: D6)
//     <2=> PTD4 (Alias: D10)
//     <0=> Default
#define SPI0_PCS1_SEL        0                   

// SPI0_PCS2 maps to [Disabled, PTC2, PTD5]
//   <o> SPI0_PCS2 Pin Selection [PTC2(A3), PTD5(D13)] 
//   <i> Selects which pin is used for SPI0_PCS2
//     <0=> Disabled
//     <1=> PTC2 (Alias: A3)
//     <2=> PTD5 (Alias: D13)
//     <0=> Default
#define SPI0_PCS2_SEL        0                   

// SPI0_PCS3 maps to [Disabled, PTC1, PTD6]
//   <o> SPI0_PCS3 Pin Selection [PTC1(A2), PTD6(D11)] 
//   <i> Selects which pin is used for SPI0_PCS3
//     <0=> Disabled
//     <1=> PTC1 (Alias: A2)
//     <2=> PTD6 (Alias: D11)
//     <0=> Default
#define SPI0_PCS3_SEL        0                   

