podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK22F51212.h
// SPI0_PCS4 maps to [Disabled, PTC0]
//   <o> SPI0_PCS4 Pin Selection [PTC0] 
//   <i> Selects which pin is used for SPI0_PCS4
//     <0=> Disabled
//     <1=> PTC0
//     <0=> Default
#define SPI0_PCS4_SEL        0                   

// SPI0_PCS5 maps to [Disabled, PTB23]
//   <o> SPI0_PCS5 Pin Selection [PTB23] 
//   <i> Selects which pin is used for SPI0_PCS5
//     <0=> Disabled
//     <1=> PTB23
//     <0=> Default
#define SPI0_PCS5_SEL        0                   

// SPI0_SCK maps to [Disabled, PTA15, PTC5, PTD1]
//   <o> SPI0_SCK Pin Selection [PTA15, PTC5, PTD1] 
//   <i> Selects which pin is used for SPI0_SCK
//     <0=> Disabled
//     <1=> PTA15
//     <2=> PTC5
//     <3=> PTD1
//     <1=> Default
#define SPI0_SCK_SEL         1                   

// SPI0_SIN maps to [Disabled, PTA17, PTC7, PTD3]
//   <o> SPI0_SIN Pin Selection [PTA17, PTC7, PTD3(D1)] 
//   <i> Selects which pin is used for SPI0_SIN
//     <0=> Disabled
//     <1=> PTA17
//     <2=> PTC7
//     <3=> PTD3 (Alias: D1)
//     <1=> Default
#define SPI0_SIN_SEL         1                   

// SPI0_SOUT maps to [Disabled, PTA16, PTC6, PTD2]
//   <o> SPI0_SOUT Pin Selection [PTA16, PTC6(D7), PTD2(D0)] 
//   <i> Selects which pin is used for SPI0_SOUT
//     <0=> Disabled
//     <1=> PTA16
//     <2=> PTC6 (Alias: D7)
//     <3=> PTD2 (Alias: D0)
//     <1=> Default
#define SPI0_SOUT_SEL        1                   

// SPI1_PCS0 maps to [Disabled, PTB10, PTD4, PTE4]
//   <o> SPI1_PCS0 Pin Selection [PTB10, PTD4(D10), PTE4] 
//   <i> Selects which pin is used for SPI1_PCS0
//     <0=> Disabled
//     <1=> PTB10
//     <2=> PTD4 (Alias: D10)
//     <3=> PTE4
//     <0=> Default
#define SPI1_PCS0_SEL        0                   

// SPI1_PCS1 maps to [Disabled, PTB9, PTE0]
//   <o> SPI1_PCS1 Pin Selection [PTB9, PTE0(D14)] 
//   <i> Selects which pin is used for SPI1_PCS1
//     <0=> Disabled
//     <1=> PTB9
//     <2=> PTE0 (Alias: D14)
//     <0=> Default
#define SPI1_PCS1_SEL        0                   

// SPI1_PCS2 maps to [Disabled, PTE5]
//   <o> SPI1_PCS2 Pin Selection [PTE5] 
//   <i> Selects which pin is used for SPI1_PCS2
//     <0=> Disabled
//     <1=> PTE5
//     <0=> Default
#define SPI1_PCS2_SEL        0                   

// SPI1_PCS3 maps to [Disabled, PTE6]
//   <o> SPI1_PCS3 Pin Selection [PTE6] 
//   <i> Selects which pin is used for SPI1_PCS3
//     <0=> Disabled
//     <1=> PTE6
//     <0=> Default
#define SPI1_PCS3_SEL        0                   

// SPI1_SCK maps to [Disabled, PTB11, PTD5, PTE2]
//   <o> SPI1_SCK Pin Selection [PTB11, PTD5(D13), PTE2] 
//   <i> Selects which pin is used for SPI1_SCK
//     <0=> Disabled
//     <1=> PTB11
//     <2=> PTD5 (Alias: D13)
//     <3=> PTE2
//     <2=> Default
#define SPI1_SCK_SEL         2                   

// SPI1_SIN maps to [Disabled, PTB17, PTD7, PTE1, PTE3]
//   <o> SPI1_SIN Pin Selection [PTB17, PTD7(D12), PTE1(D15), PTE3] 
//   <i> Selects which pin is used for SPI1_SIN
//     <0=> Disabled
//     <1=> PTB17
//     <2=> PTD7 (Alias: D12)
//     <3=> PTE1 (Alias: D15)
//     <4=> PTE3
//     <2=> Default
#define SPI1_SIN_SEL         2                   

// SPI1_SOUT maps to [Disabled, PTB16, PTD6, PTE1, PTE3]
//   <o> SPI1_SOUT Pin Selection [PTB16(D2), PTD6(D11), PTE1(D15), PTE3] 
//   <i> Selects which pin is used for SPI1_SOUT
//     <0=> Disabled
//     <1=> PTB16 (Alias: D2)
//     <2=> PTD6 (Alias: D11)
//     <3=> PTE1 (Alias: D15)
//     <4=> PTE3
//     <2=> Default
#define SPI1_SOUT_SEL        2                   

// ADC0_DM0

// ADC0_DM1

// ADC0_DP0

// ADC0_DP1

// ADC0_SE23 = ADC0_23
#define ADC0_SE23_ADC_NUM          0     //!< ADC0_SE23 ADC number
#define ADC0_SE23_ADC_CH           23    //!< ADC0_SE23 ADC channel

// ADC1_DM0

// ADC1_DM1

// ADC1_DP0

// ADC1_DP1

// ADC1_SE18 = ADC1_18
#define ADC1_SE18_ADC_NUM          1     //!< ADC1_SE18 ADC number
#define ADC1_SE18_ADC_CH           18    //!< ADC1_SE18 ADC channel

// ADC1_SE23 = ADC1_23
#define ADC1_SE23_ADC_NUM          1     //!< ADC1_SE23 ADC number
#define ADC1_SE23_ADC_CH           23    //!< ADC1_SE23 ADC channel

// PTA0 = FTM0_5
#define PTA0_PORT                  A     //!< PTA0 Port name
#define PTA0_NUM                   0     //!< PTA0 Port number
#if FTM0_5_SEL == 1
#define PTA0_FTM_NUM               0     //!< PTA0 FTM number
#define PTA0_FTM_CH                5     //!< PTA0 FTM channel
#define PTA0_FTM_FN                3     //!< PTA0 Pin multiplexor for FTM
#endif

// PTA1 = FTM0_6 (Alias: D9)
#define PTA1_PORT                  A     //!< PTA1 Port name
#define PTA1_NUM                   1     //!< PTA1 Port number
#if FTM0_6_SEL == 1
#define PTA1_FTM_NUM               0     //!< PTA1 FTM number
#define PTA1_FTM_CH                6     //!< PTA1 FTM channel
#define PTA1_FTM_FN                3     //!< PTA1 Pin multiplexor for FTM
#endif

// PTA2 = FTM0_7 (Alias: D3)
#define PTA2_PORT                  A     //!< PTA2 Port name
#define PTA2_NUM                   2     //!< PTA2 Port number
#if FTM0_7_SEL == 1
#define PTA2_FTM_NUM               0     //!< PTA2 FTM number
#define PTA2_FTM_CH                7     //!< PTA2 FTM channel
#define PTA2_FTM_FN                3     //!< PTA2 Pin multiplexor for FTM
#endif

// PTA3 = FTM0_0
#define PTA3_PORT                  A     //!< PTA3 Port name
#define PTA3_NUM                   3     //!< PTA3 Port number
#if FTM0_0_SEL == 1
#define PTA3_FTM_NUM               0     //!< PTA3 FTM number
#define PTA3_FTM_CH                0     //!< PTA3 FTM channel
#define PTA3_FTM_FN                3     //!< PTA3 Pin multiplexor for FTM
#endif

// PTA4 = FTM0_1 (Alias: D4)
#define PTA4_PORT                  A     //!< PTA4 Port name
#define PTA4_NUM                   4     //!< PTA4 Port number
#if FTM0_1_SEL == 1
#define PTA4_FTM_NUM               0     //!< PTA4 FTM number
#define PTA4_FTM_CH                1     //!< PTA4 FTM channel
#define PTA4_FTM_FN                3     //!< PTA4 Pin multiplexor for FTM
#endif

// PTA5 = FTM0_2
#define PTA5_PORT                  A     //!< PTA5 Port name
#define PTA5_NUM                   5     //!< PTA5 Port number
#if FTM0_2_SEL == 1
#define PTA5_FTM_NUM               0     //!< PTA5 FTM number
#define PTA5_FTM_CH                2     //!< PTA5 FTM channel
#define PTA5_FTM_FN                3     //!< PTA5 Pin multiplexor for FTM
#endif

// PTA12 = FTM1_0
#define PTA12_PORT                 A     //!< PTA12 Port name
#define PTA12_NUM                  12    //!< PTA12 Port number
#if FTM1_0_SEL == 1
#define PTA12_FTM_NUM              1     //!< PTA12 FTM number
#define PTA12_FTM_CH               0     //!< PTA12 FTM channel
#define PTA12_FTM_FN               3     //!< PTA12 Pin multiplexor for FTM
#endif

// PTA13 = FTM1_1
#define PTA13_PORT                 A     //!< PTA13 Port name
#define PTA13_NUM                  13    //!< PTA13 Port number
#if FTM1_1_SEL == 1
#define PTA13_FTM_NUM              1     //!< PTA13 FTM number
#define PTA13_FTM_CH               1     //!< PTA13 FTM channel
#define PTA13_FTM_FN               3     //!< PTA13 Pin multiplexor for FTM
#endif

// PTA14 = SPI0_PCS0
#define PTA14_PORT                 A     //!< PTA14 Port name
#define PTA14_NUM                  14    //!< PTA14 Port number
#if SPI0_PCS0_SEL == 1
#define SPI0_PCS0_FN               2     //!< PTA14 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTA14  //!< PTA14 = SPI
#endif

