podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK22F51212.h
// PTA15 = SPI0_SCK
#define PTA15_PORT                 A     //!< PTA15 Port name
#define PTA15_NUM                  15    //!< PTA15 Port number
#if SPI0_SCK_SEL == 1
#define SPI0_SCK_FN                2     //!< PTA15 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTA15  //!< PTA15 = SPI
#endif

// PTA16 = SPI0_SOUT
#define PTA16_PORT                 A     //!< PTA16 Port name
#define PTA16_NUM                  16    //!< PTA16 Port number
#if SPI0_SOUT_SEL == 1
#define SPI0_SOUT_FN               2     //!< PTA16 Pin multiplexor for SPI
#define SPI0_SOUT_GPIO             digitalIO_PTA16  //!< PTA16 = SPI
#endif

// PTA17 = ADC1_17,SPI0_SIN
#define PTA17_PORT                 A     //!< PTA17 Port name
#define PTA17_NUM                  17    //!< PTA17 Port number
#define PTA17_ADC_NUM              1     //!< PTA17 ADC number
#define PTA17_ADC_CH               17    //!< PTA17 ADC channel
#if SPI0_SIN_SEL == 1
#define SPI0_SIN_FN                2     //!< PTA17 Pin multiplexor for SPI
#define SPI0_SIN_GPIO              digitalIO_PTA17  //!< PTA17 = SPI
#endif

// PTA18
#define PTA18_PORT                 A     //!< PTA18 Port name
#define PTA18_NUM                  18    //!< PTA18 Port number

// PTA19
#define PTA19_PORT                 A     //!< PTA19 Port name
#define PTA19_NUM                  19    //!< PTA19 Port number

// PTB0 = ADC1_8,FTM1_0,I2C0_SCL (Alias: A0)
#define PTB0_PORT                  B     //!< PTB0 Port name
#define PTB0_NUM                   0     //!< PTB0 Port number
#define PTB0_ADC_NUM               1     //!< PTB0 ADC number
#define PTB0_ADC_CH                8     //!< PTB0 ADC channel
#if FTM1_0_SEL == 2
#define PTB0_FTM_NUM               1     //!< PTB0 FTM number
#define PTB0_FTM_CH                0     //!< PTB0 FTM channel
#define PTB0_FTM_FN                3     //!< PTB0 Pin multiplexor for FTM
#endif
#if I2C0_SCL_SEL == 1
#define I2C0_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTB0  //!< PTB0 = I2C
#endif

// PTB1 = ADC1_9,FTM1_1,I2C0_SDA (Alias: A1)
#define PTB1_PORT                  B     //!< PTB1 Port name
#define PTB1_NUM                   1     //!< PTB1 Port number
#define PTB1_ADC_NUM               1     //!< PTB1 ADC number
#define PTB1_ADC_CH                9     //!< PTB1 ADC channel
#if FTM1_1_SEL == 2
#define PTB1_FTM_NUM               1     //!< PTB1 FTM number
#define PTB1_FTM_CH                1     //!< PTB1 FTM channel
#define PTB1_FTM_FN                3     //!< PTB1 Pin multiplexor for FTM
#endif
#if I2C0_SDA_SEL == 1
#define I2C0_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTB1  //!< PTB1 = I2C
#endif

// PTB2 = ADC0_12,I2C0_SCL (Alias: A5)
#define PTB2_PORT                  B     //!< PTB2 Port name
#define PTB2_NUM                   2     //!< PTB2 Port number
#define PTB2_ADC_NUM               0     //!< PTB2 ADC number
#define PTB2_ADC_CH                12    //!< PTB2 ADC channel
#if I2C0_SCL_SEL == 2
#define I2C0_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTB2  //!< PTB2 = I2C
#endif

// PTB3 = ADC0_13,I2C0_SDA (Alias: A4)
#define PTB3_PORT                  B     //!< PTB3 Port name
#define PTB3_NUM                   3     //!< PTB3 Port number
#define PTB3_ADC_NUM               0     //!< PTB3 ADC number
#define PTB3_ADC_CH                13    //!< PTB3 ADC channel
#if I2C0_SDA_SEL == 2
#define I2C0_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTB3  //!< PTB3 = I2C
#endif

// PTB6 = ADC1_12
#define PTB6_PORT                  B     //!< PTB6 Port name
#define PTB6_NUM                   6     //!< PTB6 Port number
#define PTB6_ADC_NUM               1     //!< PTB6 ADC number
#define PTB6_ADC_CH                12    //!< PTB6 ADC channel

// PTB7 = ADC1_13
#define PTB7_PORT                  B     //!< PTB7 Port name
#define PTB7_NUM                   7     //!< PTB7 Port number
#define PTB7_ADC_NUM               1     //!< PTB7 ADC number
#define PTB7_ADC_CH                13    //!< PTB7 ADC channel

// PTB8
#define PTB8_PORT                  B     //!< PTB8 Port name
#define PTB8_NUM                   8     //!< PTB8 Port number

// PTB9 = SPI1_PCS1
#define PTB9_PORT                  B     //!< PTB9 Port name
#define PTB9_NUM                   9     //!< PTB9 Port number
#if SPI1_PCS1_SEL == 1
#define SPI1_PCS1_FN               2     //!< PTB9 Pin multiplexor for SPI
#define SPI1_PCS1_GPIO             digitalIO_PTB9  //!< PTB9 = SPI
#endif

// PTB10 = ADC1_14,SPI1_PCS0
#define PTB10_PORT                 B     //!< PTB10 Port name
#define PTB10_NUM                  10    //!< PTB10 Port number
#define PTB10_ADC_NUM              1     //!< PTB10 ADC number
#define PTB10_ADC_CH               14    //!< PTB10 ADC channel
#if SPI1_PCS0_SEL == 1
#define SPI1_PCS0_FN               2     //!< PTB10 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTB10  //!< PTB10 = SPI
#endif

// PTB11 = ADC1_15,SPI1_SCK
#define PTB11_PORT                 B     //!< PTB11 Port name
#define PTB11_NUM                  11    //!< PTB11 Port number
#define PTB11_ADC_NUM              1     //!< PTB11 ADC number
#define PTB11_ADC_CH               15    //!< PTB11 ADC channel
#if SPI1_SCK_SEL == 1
#define SPI1_SCK_FN                2     //!< PTB11 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTB11  //!< PTB11 = SPI
#endif

// PTB16 = SPI1_SOUT (Alias: D2)
#define PTB16_PORT                 B     //!< PTB16 Port name
#define PTB16_NUM                  16    //!< PTB16 Port number
#if SPI1_SOUT_SEL == 1
#define SPI1_SOUT_FN               2     //!< PTB16 Pin multiplexor for SPI
#define SPI1_SOUT_GPIO             digitalIO_PTB16  //!< PTB16 = SPI
#endif

// PTB17 = SPI1_SIN
#define PTB17_PORT                 B     //!< PTB17 Port name
#define PTB17_NUM                  17    //!< PTB17 Port number
#if SPI1_SIN_SEL == 1
#define SPI1_SIN_FN                2     //!< PTB17 Pin multiplexor for SPI
#define SPI1_SIN_GPIO              digitalIO_PTB17  //!< PTB17 = SPI
#endif

// PTB18 = FTM2_0 (Alias: D5)
#define PTB18_PORT                 B     //!< PTB18 Port name
#define PTB18_NUM                  18    //!< PTB18 Port number
#define PTB18_FTM_NUM              2     //!< PTB18 FTM number
#define PTB18_FTM_CH               0     //!< PTB18 FTM channel
#define PTB18_FTM_FN               3     //!< PTB18 Pin multiplexor for FTM

// PTB19 = FTM2_1 (Alias: D8)
#define PTB19_PORT                 B     //!< PTB19 Port name
#define PTB19_NUM                  19    //!< PTB19 Port number
#define PTB19_FTM_NUM              2     //!< PTB19 FTM number
#define PTB19_FTM_CH               1     //!< PTB19 FTM channel
#define PTB19_FTM_FN               3     //!< PTB19 Pin multiplexor for FTM

// PTB20
#define PTB20_PORT                 B     //!< PTB20 Port name
#define PTB20_NUM                  20    //!< PTB20 Port number

// PTB21
#define PTB21_PORT                 B     //!< PTB21 Port name
#define PTB21_NUM                  21    //!< PTB21 Port number

// PTB22
#define PTB22_PORT                 B     //!< PTB22 Port name
#define PTB22_NUM                  22    //!< PTB22 Port number

// PTB23 = SPI0_PCS5
#define PTB23_PORT                 B     //!< PTB23 Port name
#define PTB23_NUM                  23    //!< PTB23 Port number
#if SPI0_PCS5_SEL == 1
#define SPI0_PCS5_FN               3     //!< PTB23 Pin multiplexor for SPI
#define SPI0_PCS5_GPIO             digitalIO_PTB23  //!< PTB23 = SPI
#endif

