podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK22F51212.h
// PTC0 = ADC0_14,SPI0_PCS4
#define PTC0_PORT                  C     //!< PTC0 Port name
#define PTC0_NUM                   0     //!< PTC0 Port number
#define PTC0_ADC_NUM               0     //!< PTC0 ADC number
#define PTC0_ADC_CH                14    //!< PTC0 ADC channel
#if SPI0_PCS4_SEL == 1
#define SPI0_PCS4_FN               2     //!< PTC0 Pin multiplexor for SPI
#define SPI0_PCS4_GPIO             digitalIO_PTC0  //!< PTC0 = SPI
#endif

// PTC1 = ADC0_15,FTM0_0,SPI0_PCS3 (Alias: A2)
#define PTC1_PORT                  C     //!< PTC1 Port name
#define PTC1_NUM                   1     //!< PTC1 Port number
#define PTC1_ADC_NUM               0     //!< PTC1 ADC number
#define PTC1_ADC_CH                15    //!< PTC1 ADC channel
#if FTM0_0_SEL == 2
#define PTC1_FTM_NUM               0     //!< PTC1 FTM number
#define PTC1_FTM_CH                0     //!< PTC1 FTM channel
#define PTC1_FTM_FN                4     //!< PTC1 Pin multiplexor for FTM
#endif
#if SPI0_PCS3_SEL == 1
#define SPI0_PCS3_FN               2     //!< PTC1 Pin multiplexor for SPI
#define SPI0_PCS3_GPIO             digitalIO_PTC1  //!< PTC1 = SPI
#endif

// PTC2 = ADC0_4,FTM0_1,SPI0_PCS2 (Alias: A3)
#define PTC2_PORT                  C     //!< PTC2 Port name
#define PTC2_NUM                   2     //!< PTC2 Port number
#define PTC2_ADC_NUM               0     //!< PTC2 ADC number
#define PTC2_ADC_CH                4     //!< PTC2 ADC channel
#if FTM0_1_SEL == 2
#define PTC2_FTM_NUM               0     //!< PTC2 FTM number
#define PTC2_FTM_CH                1     //!< PTC2 FTM channel
#define PTC2_FTM_FN                4     //!< PTC2 Pin multiplexor for FTM
#endif
#if SPI0_PCS2_SEL == 1
#define SPI0_PCS2_FN               2     //!< PTC2 Pin multiplexor for SPI
#define SPI0_PCS2_GPIO             digitalIO_PTC2  //!< PTC2 = SPI
#endif

// PTC3 = FTM0_2,SPI0_PCS1 (Alias: D6)
#define PTC3_PORT                  C     //!< PTC3 Port name
#define PTC3_NUM                   3     //!< PTC3 Port number
#if FTM0_2_SEL == 2
#define PTC3_FTM_NUM               0     //!< PTC3 FTM number
#define PTC3_FTM_CH                2     //!< PTC3 FTM channel
#define PTC3_FTM_FN                4     //!< PTC3 Pin multiplexor for FTM
#endif
#if SPI0_PCS1_SEL == 1
#define SPI0_PCS1_FN               2     //!< PTC3 Pin multiplexor for SPI
#define SPI0_PCS1_GPIO             digitalIO_PTC3  //!< PTC3 = SPI
#endif

// PTC4 = FTM0_3,SPI0_PCS0
#define PTC4_PORT                  C     //!< PTC4 Port name
#define PTC4_NUM                   4     //!< PTC4 Port number
#define PTC4_FTM_NUM               0     //!< PTC4 FTM number
#define PTC4_FTM_CH                3     //!< PTC4 FTM channel
#define PTC4_FTM_FN                4     //!< PTC4 Pin multiplexor for FTM
#if SPI0_PCS0_SEL == 2
#define SPI0_PCS0_FN               2     //!< PTC4 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTC4  //!< PTC4 = SPI
#endif

// PTC5 = FTM0_2,SPI0_SCK
#define PTC5_PORT                  C     //!< PTC5 Port name
#define PTC5_NUM                   5     //!< PTC5 Port number
#if FTM0_2_SEL == 3
#define PTC5_FTM_NUM               0     //!< PTC5 FTM number
#define PTC5_FTM_CH                2     //!< PTC5 FTM channel
#define PTC5_FTM_FN                7     //!< PTC5 Pin multiplexor for FTM
#endif
#if SPI0_SCK_SEL == 2
#define SPI0_SCK_FN                2     //!< PTC5 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTC5  //!< PTC5 = SPI
#endif

// PTC6 = SPI0_SOUT (Alias: D7)
#define PTC6_PORT                  C     //!< PTC6 Port name
#define PTC6_NUM                   6     //!< PTC6 Port number
#if SPI0_SOUT_SEL == 2
#define SPI0_SOUT_FN               2     //!< PTC6 Pin multiplexor for SPI
#define SPI0_SOUT_GPIO             digitalIO_PTC6  //!< PTC6 = SPI
#endif

// PTC7 = SPI0_SIN
#define PTC7_PORT                  C     //!< PTC7 Port name
#define PTC7_NUM                   7     //!< PTC7 Port number
#if SPI0_SIN_SEL == 2
#define SPI0_SIN_FN                2     //!< PTC7 Pin multiplexor for SPI
#define SPI0_SIN_GPIO              digitalIO_PTC7  //!< PTC7 = SPI
#endif

// PTC8 = ADC1_4
#define PTC8_PORT                  C     //!< PTC8 Port name
#define PTC8_NUM                   8     //!< PTC8 Port number
#define PTC8_ADC_NUM               1     //!< PTC8 ADC number
#define PTC8_ADC_CH                4     //!< PTC8 ADC channel

// PTC9 = ADC1_5
#define PTC9_PORT                  C     //!< PTC9 Port name
#define PTC9_NUM                   9     //!< PTC9 Port number
#define PTC9_ADC_NUM               1     //!< PTC9 ADC number
#define PTC9_ADC_CH                5     //!< PTC9 ADC channel

// PTC10 = ADC1_6,I2C1_SCL
#define PTC10_PORT                 C     //!< PTC10 Port name
#define PTC10_NUM                  10    //!< PTC10 Port number
#define PTC10_ADC_NUM              1     //!< PTC10 ADC number
#define PTC10_ADC_CH               6     //!< PTC10 ADC channel
#if I2C1_SCL_SEL == 1
#define I2C1_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SCL_GPIO              digitalIO_PTC10  //!< PTC10 = I2C
#endif

// PTC11 = ADC1_7,I2C1_SDA
#define PTC11_PORT                 C     //!< PTC11 Port name
#define PTC11_NUM                  11    //!< PTC11 Port number
#define PTC11_ADC_NUM              1     //!< PTC11 ADC number
#define PTC11_ADC_CH               7     //!< PTC11 ADC channel
#if I2C1_SDA_SEL == 1
#define I2C1_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SDA_GPIO              digitalIO_PTC11  //!< PTC11 = I2C
#endif

// PTC12
#define PTC12_PORT                 C     //!< PTC12 Port name
#define PTC12_NUM                  12    //!< PTC12 Port number

// PTC13
#define PTC13_PORT                 C     //!< PTC13 Port name
#define PTC13_NUM                  13    //!< PTC13 Port number

// PTC14
#define PTC14_PORT                 C     //!< PTC14 Port name
#define PTC14_NUM                  14    //!< PTC14 Port number

// PTC15
#define PTC15_PORT                 C     //!< PTC15 Port name
#define PTC15_NUM                  15    //!< PTC15 Port number

