podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK22F51212.h
// PTC16
#define PTC16_PORT                 C     //!< PTC16 Port name
#define PTC16_NUM                  16    //!< PTC16 Port number

// PTC17
#define PTC17_PORT                 C     //!< PTC17 Port name
#define PTC17_NUM                  17    //!< PTC17 Port number

// PTC18
#define PTC18_PORT                 C     //!< PTC18 Port name
#define PTC18_NUM                  18    //!< PTC18 Port number

// PTC19
#define PTC19_PORT                 C     //!< PTC19 Port name
#define PTC19_NUM                  19    //!< PTC19 Port number

// PTD0 = SPI0_PCS0
#define PTD0_PORT                  D     //!< PTD0 Port name
#define PTD0_NUM                   0     //!< PTD0 Port number
#if SPI0_PCS0_SEL == 3
#define SPI0_PCS0_FN               2     //!< PTD0 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTD0  //!< PTD0 = SPI
#endif

// PTD1 = ADC0_5,SPI0_SCK
#define PTD1_PORT                  D     //!< PTD1 Port name
#define PTD1_NUM                   1     //!< PTD1 Port number
#define PTD1_ADC_NUM               0     //!< PTD1 ADC number
#define PTD1_ADC_CH                5     //!< PTD1 ADC channel
#if SPI0_SCK_SEL == 3
#define SPI0_SCK_FN                2     //!< PTD1 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTD1  //!< PTD1 = SPI
#endif

// PTD2 = SPI0_SOUT,I2C0_SCL (Alias: D0)
#define PTD2_PORT                  D     //!< PTD2 Port name
#define PTD2_NUM                   2     //!< PTD2 Port number
#if SPI0_SOUT_SEL == 3
#define SPI0_SOUT_FN               2     //!< PTD2 Pin multiplexor for SPI
#define SPI0_SOUT_GPIO             digitalIO_PTD2  //!< PTD2 = SPI
#endif
#if I2C0_SCL_SEL == 3
#define I2C0_SCL_FN                7     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTD2  //!< PTD2 = I2C
#endif

// PTD3 = SPI0_SIN,I2C0_SDA (Alias: D1)
#define PTD3_PORT                  D     //!< PTD3 Port name
#define PTD3_NUM                   3     //!< PTD3 Port number
#if SPI0_SIN_SEL == 3
#define SPI0_SIN_FN                2     //!< PTD3 Pin multiplexor for SPI
#define SPI0_SIN_GPIO              digitalIO_PTD3  //!< PTD3 = SPI
#endif
#if I2C0_SDA_SEL == 3
#define I2C0_SDA_FN                7     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTD3  //!< PTD3 = I2C
#endif

// PTD4 = FTM0_4,SPI0_PCS1,SPI1_PCS0 (Alias: D10)
#define PTD4_PORT                  D     //!< PTD4 Port name
#define PTD4_NUM                   4     //!< PTD4 Port number
#define PTD4_FTM_NUM               0     //!< PTD4 FTM number
#define PTD4_FTM_CH                4     //!< PTD4 FTM channel
#define PTD4_FTM_FN                4     //!< PTD4 Pin multiplexor for FTM
#if SPI0_PCS1_SEL == 2
#define SPI0_PCS1_FN               2     //!< PTD4 Pin multiplexor for SPI
#define SPI0_PCS1_GPIO             digitalIO_PTD4  //!< PTD4 = SPI
#endif
#if SPI1_PCS0_SEL == 2
#define SPI1_PCS0_FN               7     //!< PTD4 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTD4  //!< PTD4 = SPI
#endif

// PTD5 = ADC0_6,FTM0_5,SPI0_PCS2,SPI1_SCK (Alias: D13)
#define PTD5_PORT                  D     //!< PTD5 Port name
#define PTD5_NUM                   5     //!< PTD5 Port number
#define PTD5_ADC_NUM               0     //!< PTD5 ADC number
#define PTD5_ADC_CH                6     //!< PTD5 ADC channel
#if FTM0_5_SEL == 2
#define PTD5_FTM_NUM               0     //!< PTD5 FTM number
#define PTD5_FTM_CH                5     //!< PTD5 FTM channel
#define PTD5_FTM_FN                4     //!< PTD5 Pin multiplexor for FTM
#endif
#if SPI0_PCS2_SEL == 2
#define SPI0_PCS2_FN               2     //!< PTD5 Pin multiplexor for SPI
#define SPI0_PCS2_GPIO             digitalIO_PTD5  //!< PTD5 = SPI
#endif
#if SPI1_SCK_SEL == 2
#define SPI1_SCK_FN                7     //!< PTD5 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTD5  //!< PTD5 = SPI
#endif

// PTD6 = ADC0_7,FTM0_6,SPI0_PCS3,SPI1_SOUT (Alias: D11)
#define PTD6_PORT                  D     //!< PTD6 Port name
#define PTD6_NUM                   6     //!< PTD6 Port number
#define PTD6_ADC_NUM               0     //!< PTD6 ADC number
#define PTD6_ADC_CH                7     //!< PTD6 ADC channel
#if FTM0_6_SEL == 2
#define PTD6_FTM_NUM               0     //!< PTD6 FTM number
#define PTD6_FTM_CH                6     //!< PTD6 FTM channel
#define PTD6_FTM_FN                4     //!< PTD6 Pin multiplexor for FTM
#endif
#if SPI0_PCS3_SEL == 2
#define SPI0_PCS3_FN               2     //!< PTD6 Pin multiplexor for SPI
#define SPI0_PCS3_GPIO             digitalIO_PTD6  //!< PTD6 = SPI
#endif
#if SPI1_SOUT_SEL == 2
#define SPI1_SOUT_FN               7     //!< PTD6 Pin multiplexor for SPI
#define SPI1_SOUT_GPIO             digitalIO_PTD6  //!< PTD6 = SPI
#endif

// PTD7 = FTM0_7,SPI1_SIN (Alias: D12)
#define PTD7_PORT                  D     //!< PTD7 Port name
#define PTD7_NUM                   7     //!< PTD7 Port number
#if FTM0_7_SEL == 2
#define PTD7_FTM_NUM               0     //!< PTD7 FTM number
#define PTD7_FTM_CH                7     //!< PTD7 FTM channel
#define PTD7_FTM_FN                4     //!< PTD7 Pin multiplexor for FTM
#endif
#if SPI1_SIN_SEL == 2
#define SPI1_SIN_FN                7     //!< PTD7 Pin multiplexor for SPI
#define SPI1_SIN_GPIO              digitalIO_PTD7  //!< PTD7 = SPI
#endif

// PTE0 = SPI1_PCS1,I2C1_SDA (Alias: D14)
#define PTE0_PORT                  E     //!< PTE0 Port name
#define PTE0_NUM                   0     //!< PTE0 Port number
#if SPI1_PCS1_SEL == 2
#define SPI1_PCS1_FN               2     //!< PTE0 Pin multiplexor for SPI
#define SPI1_PCS1_GPIO             digitalIO_PTE0  //!< PTE0 = SPI
#endif
#if I2C1_SDA_SEL == 2
#define I2C1_SDA_FN                6     //!< Pin multiplexor for I2C
#define I2C1_SDA_GPIO              digitalIO_PTE0  //!< PTE0 = I2C
#endif

// PTE1 = SPI1_SOUT,SPI1_SIN,I2C1_SCL (Alias: D15)
#define PTE1_PORT                  E     //!< PTE1 Port name
#define PTE1_NUM                   1     //!< PTE1 Port number
#if SPI1_SOUT_SEL == 3
#define SPI1_SOUT_FN               2     //!< PTE1 Pin multiplexor for SPI
#define SPI1_SOUT_GPIO             digitalIO_PTE1  //!< PTE1 = SPI
#endif
#if SPI1_SIN_SEL == 3
#define SPI1_SIN_FN                7     //!< PTE1 Pin multiplexor for SPI
#define SPI1_SIN_GPIO              digitalIO_PTE1  //!< PTE1 = SPI
#endif
#if I2C1_SCL_SEL == 2
#define I2C1_SCL_FN                6     //!< Pin multiplexor for I2C
#define I2C1_SCL_GPIO              digitalIO_PTE1  //!< PTE1 = I2C
#endif

// PTE2 = SPI1_SCK
#define PTE2_PORT                  E     //!< PTE2 Port name
#define PTE2_NUM                   2     //!< PTE2 Port number
#if SPI1_SCK_SEL == 3
#define SPI1_SCK_FN                2     //!< PTE2 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTE2  //!< PTE2 = SPI
#endif

// PTE3 = SPI1_SIN,SPI1_SOUT
#define PTE3_PORT                  E     //!< PTE3 Port name
#define PTE3_NUM                   3     //!< PTE3 Port number
#if SPI1_SIN_SEL == 4
#define SPI1_SIN_FN                2     //!< PTE3 Pin multiplexor for SPI
#define SPI1_SIN_GPIO              digitalIO_PTE3  //!< PTE3 = SPI
#endif
#if SPI1_SOUT_SEL == 4
#define SPI1_SOUT_FN               7     //!< PTE3 Pin multiplexor for SPI
#define SPI1_SOUT_GPIO             digitalIO_PTE3  //!< PTE3 = SPI
#endif

// PTE4 = SPI1_PCS0
#define PTE4_PORT                  E     //!< PTE4 Port name
#define PTE4_NUM                   4     //!< PTE4 Port number
#if SPI1_PCS0_SEL == 3
#define SPI1_PCS0_FN               2     //!< PTE4 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTE4  //!< PTE4 = SPI
#endif

