podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK22F51212.h
// PTE5 = SPI1_PCS2
#define PTE5_PORT                  E     //!< PTE5 Port name
#define PTE5_NUM                   5     //!< PTE5 Port number
#if SPI1_PCS2_SEL == 1
#define SPI1_PCS2_FN               2     //!< PTE5 Pin multiplexor for SPI
#define SPI1_PCS2_GPIO             digitalIO_PTE5  //!< PTE5 = SPI
#endif

// PTE6 = SPI1_PCS3
#define PTE6_PORT                  E     //!< PTE6 Port name
#define PTE6_NUM                   6     //!< PTE6 Port number
#if SPI1_PCS3_SEL == 1
#define SPI1_PCS3_FN               2     //!< PTE6 Pin multiplexor for SPI
#define SPI1_PCS3_GPIO             digitalIO_PTE6  //!< PTE6 = SPI
#endif

// PTE24 = ADC0_17,I2C0_SCL
#define PTE24_PORT                 E     //!< PTE24 Port name
#define PTE24_NUM                  24    //!< PTE24 Port number
#define PTE24_ADC_NUM              0     //!< PTE24 ADC number
#define PTE24_ADC_CH               17    //!< PTE24 ADC channel
#if I2C0_SCL_SEL == 4
#define I2C0_SCL_FN                5     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTE24  //!< PTE24 = I2C
#endif

// PTE25 = ADC0_18,I2C0_SDA
#define PTE25_PORT                 E     //!< PTE25 Port name
#define PTE25_NUM                  25    //!< PTE25 Port number
#define PTE25_ADC_NUM              0     //!< PTE25 ADC number
#define PTE25_ADC_CH               18    //!< PTE25 ADC channel
#if I2C0_SDA_SEL == 4
#define I2C0_SDA_FN                5     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTE25  //!< PTE25 = I2C
#endif

// PTE26
#define PTE26_PORT                 E     //!< PTE26 Port name
#define PTE26_NUM                  26    //!< PTE26 Port number

// </h>


#endif /* PINMAPPING_H_ */
